Autodesk.Revit.DB.BuiltInFailures.DecalFailures.OutsideHost
Decal does not lie on host.

Autodesk.Revit.DB.BuiltInFailures.DecalFailures.LongerThanPossible
Decal element is longer than the circumference of the surface.

Autodesk.Revit.DB.BuiltInFailures.DecalFailures.CannotPaste
Can't place Decal at new position.

Autodesk.Revit.DB.BuiltInFailures.DecalFailures
Failures about Decal.